<?php

//3. Считать с консоли длины катетов прямоугольного треугольника и рассчитать его гипотенузу, площадь, углы(в градусах), периметр.
$a = readline("Укажите катет AC ");
$b = readline("Укажите катет BC ");
$c = sqrt(pow($a, 2) + pow($b,2));
$angle_B = atan($a/$b)*180/pi();
$angle_A = 90 - $angle_B;
echo "-----------------------------------" . "\n"
    . "Гипотенуза AB = " . $c . "; " . "\n"
    . "Площадь треугольника = " . ($a*$b/2) . "\n"
    . "Угол ABC = " . $angle_B . " град" . "\n"
    . "Угол CAB = " . $angle_A . " град". "\n"
    . "Угол AСB = 90 град" . "\n"
    . "Периметр = " . ($a + $b + $c) . ".";
